[
  {
    "port": 0,
    "commander": "Lidless Legion",
    "verb": "OBSERVE",
    "jadc2": {
      "name": "Joint ISR Operations",
      "description": "Intelligence, Surveillance, and Reconnaissance (ISR) operations to provide situational awareness.",
      "steps": [
        "Tasking: Define collection requirements based on commander's intent.",
        "Collection: Acquire raw data from multi-domain sensors.",
        "Processing: Convert raw data into usable information for analysis."
      ]
    },
    "cyber": {
      "name": "Active Scanning",
      "description": "Scanning for vulnerabilities and open ports to map the attack surface.",
      "technique_id": "T1595",
      "tactics": "Reconnaissance"
    },
    "hfo": {
      "name": "Omphalos",
      "description": "The central perception hub for gesture and kinetic sensing.",
      "provenance": "hot_obsidian_sandbox/bronze/P0_GESTURE_KINETIC_DRAFT.md",
      "pain_id": "PAIN_017",
      "mantra": "Given a stream of landmarks, When the hand closes, Then the Omphalos triggers a grab event."
    }
  },
  {
    "port": 1,
    "commander": "Web Weaver",
    "verb": "BRIDGE",
    "jadc2": {
      "name": "Joint Intelligence Fusion",
      "description": "Integrating and analyzing information from all sources to produce intelligence.",
      "steps": [
        "Integration: Combine data from disparate sources into a common format.",
        "Evaluation: Assess the reliability and accuracy of the fused data.",
        "Analysis: Identify patterns and trends to support decision-making."
      ]
    },
    "cyber": {
      "name": "Acquire Infrastructure",
      "description": "Acquiring domains, servers, and other infrastructure to support operations.",
      "technique_id": "T1583",
      "tactics": "Resource Development"
    },
    "hfo": {
      "name": "Bifrost",
      "description": "The bridge between heterogeneous data streams and the HFO core.",
      "provenance": "hot_obsidian_sandbox/bronze/P1_INTEGRATION_KINETIC.md",
      "pain_id": "PAIN_004",
      "mantra": "Given a raw payload, When it crosses the Bifrost, Then it is wrapped in a Zod-validated envelope."
    }
  },
  {
    "port": 2,
    "commander": "Mirror Magus",
    "verb": "SHAPE",
    "jadc2": {
      "name": "Joint Maneuver Operations",
      "description": "The movement of forces to achieve a position of advantage over the enemy.",
      "steps": [
        "Positioning: Move assets to optimal locations for engagement.",
        "Transformation: Adapt force posture based on environmental changes.",
        "Synchronization: Coordinate movements across domains to maximize impact."
      ]
    },
    "cyber": {
      "name": "Command and Scripting Interpreter",
      "description": "Executing commands and scripts to interact with the target system.",
      "technique_id": "T1059",
      "tactics": "Execution"
    },
    "hfo": {
      "name": "Abyssal Flow",
      "description": "The deterministic physics engine for shaping virtual and physical interactions.",
      "provenance": "hot_obsidian_sandbox/bronze/P2_SHAPING_KINETIC.md",
      "pain_id": "PAIN_007",
      "mantra": "Given a set of forces, When the Mirror Magus shapes the flow, Then the simulation remains deterministic."
    }
  },
  {
    "port": 3,
    "commander": "Spore Storm",
    "verb": "INJECT",
    "jadc2": {
      "name": "Joint Fire Support",
      "description": "The coordination and integration of fires to achieve desired effects.",
      "steps": [
        "Targeting: Identify and prioritize targets for engagement.",
        "Delivery: Deploy kinetic or non-kinetic effects to the target.",
        "Assessment: Evaluate the impact of the delivered effects."
      ]
    },
    "cyber": {
      "name": "Exfiltration Over C2 Channel",
      "description": "Exfiltrating data through the established command and control channel.",
      "technique_id": "T1041",
      "tactics": "Exfiltration"
    },
    "hfo": {
      "name": "Spores",
      "description": "The stigmergic delivery system for cascading updates and messages.",
      "provenance": "hot_obsidian_sandbox/bronze/P3_DELIVERY_KINETIC.md",
      "pain_id": "PAIN_005",
      "mantra": "Given a message, When the Spore Storm releases it, Then it propagates through the NATS mesh."
    }
  },
  {
    "port": 4,
    "commander": "Red Regnant",
    "verb": "DISRUPT",
    "jadc2": {
      "name": "Joint Information Operations",
      "description": "The integrated employment of information-related capabilities to influence or disrupt.",
      "steps": [
        "Deception: Mislead the adversary regarding friendly intentions.",
        "Disruption: Degrade the adversary's ability to communicate or decide.",
        "Exploitation: Leverage adversary vulnerabilities for strategic gain."
      ]
    },
    "cyber": {
      "name": "Data Manipulation",
      "description": "Manipulating data to disrupt operations or mislead users.",
      "technique_id": "T1565",
      "tactics": "Impact"
    },
    "hfo": {
      "name": "Grudges",
      "description": "The architectural enforcement layer that disrupts non-compliant code.",
      "provenance": "hot_obsidian_sandbox/bronze/P4_DISRUPTION_KINETIC.md",
      "pain_id": "PAIN_001",
      "mantra": "Given a violation, When the Red Regnant screams, Then the violation is logged to the Blackboard."
    }
  },
  {
    "port": 5,
    "commander": "Pyre Praetorian",
    "verb": "IMMUNIZE",
    "jadc2": {
      "name": "Joint Force Protection (MOSAIC)",
      "description": "Measures taken to protect the force and its assets from threats through dynamic surface mutation and decentralized kill-chain interruption.",
      "steps": [
        "Stigmergic Sentinel: Deploy ephemeral defense nodes in response to Blackboard violations.",
        "Surface Mutation: Implement Moving Target Defense by rotating internal tokens and port mappings.",
        "Kill-Chain Interruption: Empower components to autonomously sever connections upon integrity failure."
      ]
    },
    "cyber": {
      "name": "Impair Defenses",
      "description": "Adversaries may impair defenses to avoid detection or prevent defensive actions.",
      "technique_id": "T1562",
      "tactics": "Defense Evasion"
    },
    "hfo": {
      "name": "Agni",
      "description": "The blue flame paladin that immunizes the system through defense in depth.",
      "provenance": "hot_obsidian_sandbox/bronze/P5_PYRE_PRAETORIAN/DANCE_SPEC.md",
      "pain_id": "PAIN_002",
      "mantra": "Given a threat vector, When the Pyre Praetorian dances, Then the system is hardened against the attack."
    }
  },
  {
    "port": 6,
    "commander": "Kraken Keeper",
    "verb": "ASSIMILATE",
    "jadc2": {
      "name": "Joint Logistics",
      "description": "The coordination and integration of logistics to support operations.",
      "steps": [
        "Storage: Maintain and manage supplies and equipment.",
        "Distribution: Deliver supplies and equipment to the force.",
        "Maintenance: Ensure the readiness and functionality of assets."
      ]
    },
    "cyber": {
      "name": "Data from Local System",
      "description": "Adversaries may search local system sources, such as file systems and configuration files, to find sensitive data.",
      "technique_id": "T1005",
      "tactics": "Collection"
    },
    "hfo": {
      "name": "Medallion Lake",
      "description": "The persistent storage layer for all HFO memories and artifacts.",
      "provenance": "hot_obsidian_sandbox/bronze/P6_KRAKEN_KEEPER_DRAFT.md",
      "pain_id": "PAIN_003",
      "mantra": "Given a new artifact, When the Kraken Keeper assimilates it, Then it is stored in the Medallion Lake with full provenance."
    }
  },
  {
    "port": 7,
    "commander": "Spider Sovereign",
    "verb": "NAVIGATE",
    "jadc2": {
      "name": "Joint Planning",
      "description": "The development of plans to achieve mission objectives.",
      "steps": [
        "Planning: Develop courses of action to achieve mission objectives.",
        "Decision: Select the optimal course of action based on intelligence.",
        "Direction: Issue orders to subordinate units to execute the plan."
      ]
    },
    "cyber": {
      "name": "Application Layer Protocol",
      "description": "Adversaries may communicate using OSI application layer protocols to avoid detection/network filtering by blending in with existing traffic.",
      "technique_id": "T1071",
      "tactics": "Command and Control"
    },
    "hfo": {
      "name": "Firmament",
      "description": "The system of systems that navigates the swarm through the strategic landscape.",
      "provenance": "hot_obsidian_sandbox/bronze/P7_DECISION_KINETIC.md",
      "pain_id": "PAIN_008",
      "mantra": "Given a goal, When the Spider Sovereign navigates, Then the swarm moves towards the objective."
    }
  }
]
